experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run3_vclients1_workerthreads64_client2_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:       18513 ops,     286 (avg:     264) ops/sec, 1.13MB/sec (avg: 1.04MB/sec),  3.48 (avg:  3.78) msec latency

1         Threads
1         Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets         264.46          ---          ---      3.77500      1067.35 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals       264.46         0.00         0.00      3.77500      1067.35 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.830         0.01
SET       0.870         0.01
SET       0.880         0.03
SET       0.890         0.06
SET       0.900         0.08
SET       0.910         0.08
SET       0.920         0.13
SET       0.930         0.21
SET       0.940         0.26
SET       0.950         0.33
SET       0.960         0.41
SET       0.970         0.53
SET       0.980         0.66
SET       0.990         0.77
SET       1.000         1.64
SET       1.100         4.67
SET       1.200         9.69
SET       1.300        16.13
SET       1.400        22.34
SET       1.500        28.06
SET       1.600        32.74
SET       1.700        36.52
SET       1.800        39.84
SET       1.900        42.72
SET       2.000        45.15
SET       2.100        47.34
SET       2.200        49.26
SET       2.300        50.77
SET       2.400        52.15
SET       2.500        53.39
SET       2.600        54.46
SET       2.700        55.44
SET       2.800        56.33
SET       2.900        57.17
SET       3.000        57.91
SET       3.100        58.72
SET       3.200        59.47
SET       3.300        60.11
SET       3.400        60.75
SET       3.500        61.38
SET       3.600        61.92
SET       3.700        62.49
SET       3.800        62.96
SET       3.900        63.56
SET       4.000        64.05
SET       4.100        64.66
SET       4.200        65.16
SET       4.300        65.69
SET       4.400        66.27
SET       4.500        66.89
SET       4.600        67.45
SET       4.700        68.06
SET       4.800        68.56
SET       4.900        69.26
SET       5.000        69.85
SET       5.100        70.33
SET       5.200        70.90
SET       5.300        71.56
SET       5.400        72.14
SET       5.500        72.81
SET       5.600        73.42
SET       5.700        74.10
SET       5.800        74.86
SET       5.900        75.57
SET       6.000        76.20
SET       6.100        76.83
SET       6.200        77.55
SET       6.300        78.37
SET       6.400        79.17
SET       6.500        79.98
SET       6.600        80.72
SET       6.700        81.45
SET       6.800        82.27
SET       6.900        83.07
SET       7.000        83.96
SET       7.100        84.75
SET       7.200        85.72
SET       7.300        86.57
SET       7.400        87.39
SET       7.500        88.13
SET       7.600        88.88
SET       7.700        89.68
SET       7.800        90.32
SET       7.900        91.03
SET       8.000        91.76
SET       8.100        92.28
SET       8.200        92.73
SET       8.300        93.24
SET       8.400        93.72
SET       8.500        94.18
SET       8.600        94.57
SET       8.700        94.86
SET       8.800        95.13
SET       8.900        95.38
SET       9.000        95.65
SET       9.100        95.93
SET       9.200        96.12
SET       9.300        96.34
SET       9.400        96.49
SET       9.500        96.65
SET       9.600        96.80
SET       9.700        96.95
SET       9.800        97.08
SET       9.900        97.22
SET      10.000        97.77
SET      11.000        98.26
SET      12.000        98.63
SET      13.000        98.95
SET      14.000        99.20
SET      15.000        99.42
SET      16.000        99.58
SET      17.000        99.72
SET      18.000        99.77
SET      19.000        99.80
SET      20.000        99.82
SET      22.000        99.84
SET      23.000        99.85
SET      24.000        99.88
SET      25.000        99.90
SET      26.000        99.91
SET      27.000        99.92
SET      28.000        99.94
SET      29.000        99.94
SET      30.000        99.95
SET      31.000        99.96
SET      32.000        99.98
SET      33.000        99.98
SET      48.000        99.99
SET      69.000        99.99
SET      93.000       100.00
---
---