experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run3_vclients32_workerthreads16_client3_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      121015 ops,    1905 (avg:    1728) ops/sec, 7.51MB/sec (avg: 6.81MB/sec), 16.80 (avg: 18.51) msec latency

1         Threads
32        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1743.99          ---          ---     18.51000      7038.80 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1743.99         0.00         0.00     18.51000      7038.80 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       2.200         0.00
SET       3.000         0.00
SET       3.200         0.00
SET       3.300         0.01
SET       3.500         0.01
SET       3.600         0.01
SET       3.800         0.01
SET       3.900         0.01
SET       4.000         0.01
SET       4.100         0.02
SET       4.200         0.02
SET       4.300         0.02
SET       4.400         0.03
SET       4.500         0.03
SET       4.700         0.03
SET       4.800         0.03
SET       4.900         0.04
SET       5.000         0.04
SET       5.100         0.04
SET       5.200         0.04
SET       5.300         0.05
SET       5.400         0.05
SET       5.500         0.05
SET       5.600         0.05
SET       5.700         0.06
SET       5.800         0.06
SET       5.900         0.07
SET       6.000         0.07
SET       6.100         0.07
SET       6.200         0.08
SET       6.300         0.09
SET       6.400         0.09
SET       6.500         0.10
SET       6.600         0.10
SET       6.700         0.11
SET       6.800         0.11
SET       6.900         0.12
SET       7.000         0.13
SET       7.100         0.14
SET       7.200         0.15
SET       7.300         0.16
SET       7.400         0.17
SET       7.500         0.17
SET       7.600         0.18
SET       7.700         0.20
SET       7.800         0.22
SET       7.900         0.24
SET       8.000         0.25
SET       8.100         0.26
SET       8.200         0.27
SET       8.300         0.29
SET       8.400         0.31
SET       8.500         0.34
SET       8.600         0.37
SET       8.700         0.38
SET       8.800         0.42
SET       8.900         0.46
SET       9.000         0.48
SET       9.100         0.51
SET       9.200         0.55
SET       9.300         0.59
SET       9.400         0.63
SET       9.500         0.68
SET       9.600         0.74
SET       9.700         0.81
SET       9.800         0.89
SET       9.900         0.96
SET      10.000         1.62
SET      11.000         3.94
SET      12.000         8.23
SET      13.000        15.45
SET      14.000        25.48
SET      15.000        35.04
SET      16.000        43.14
SET      17.000        49.55
SET      18.000        55.22
SET      19.000        60.88
SET      20.000        68.11
SET      21.000        74.52
SET      22.000        80.33
SET      23.000        84.85
SET      24.000        88.31
SET      25.000        90.99
SET      26.000        93.10
SET      27.000        94.93
SET      28.000        96.06
SET      29.000        96.85
SET      30.000        97.49
SET      31.000        97.84
SET      32.000        98.10
SET      33.000        98.32
SET      34.000        98.46
SET      35.000        98.63
SET      36.000        98.77
SET      37.000        98.92
SET      38.000        99.05
SET      39.000        99.16
SET      40.000        99.28
SET      41.000        99.39
SET      42.000        99.52
SET      43.000        99.61
SET      44.000        99.67
SET      45.000        99.73
SET      46.000        99.78
SET      47.000        99.82
SET      48.000        99.87
SET      49.000        99.90
SET      50.000        99.93
SET      51.000        99.95
SET      52.000        99.95
SET      53.000        99.96
SET      54.000        99.96
SET      55.000        99.97
SET      56.000        99.98
SET      57.000        99.98
SET      58.000        99.99
SET      59.000        99.99
SET      60.000        99.99
SET      67.000       100.00
SET      69.000       100.00
SET      70.000       100.00
SET      71.000       100.00
---
---