experiments/throughput_for_writes/logs/20181113170159/ratio1:0_run3_vclients32_workerthreads64_client2_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      155463 ops,    2220 (avg:    2220) ops/sec, 8.75MB/sec (avg: 8.75MB/sec), 14.43 (avg: 14.41) msec latency

1         Threads
32        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2220.60          ---          ---     14.40600      8962.38 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2220.60         0.00         0.00     14.40600      8962.38 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.300         0.00
SET       1.400         0.00
SET       1.500         0.01
SET       1.600         0.01
SET       1.700         0.01
SET       1.800         0.02
SET       1.900         0.03
SET       2.000         0.04
SET       2.100         0.05
SET       2.200         0.07
SET       2.300         0.08
SET       2.400         0.11
SET       2.500         0.13
SET       2.600         0.15
SET       2.700         0.17
SET       2.800         0.20
SET       2.900         0.23
SET       3.000         0.26
SET       3.100         0.29
SET       3.200         0.32
SET       3.300         0.35
SET       3.400         0.38
SET       3.500         0.41
SET       3.600         0.46
SET       3.700         0.50
SET       3.800         0.55
SET       3.900         0.60
SET       4.000         0.66
SET       4.100         0.71
SET       4.200         0.76
SET       4.300         0.82
SET       4.400         0.88
SET       4.500         0.94
SET       4.600         1.01
SET       4.700         1.07
SET       4.800         1.13
SET       4.900         1.21
SET       5.000         1.30
SET       5.100         1.39
SET       5.200         1.48
SET       5.300         1.57
SET       5.400         1.67
SET       5.500         1.78
SET       5.600         1.89
SET       5.700         2.00
SET       5.800         2.12
SET       5.900         2.26
SET       6.000         2.39
SET       6.100         2.52
SET       6.200         2.65
SET       6.300         2.82
SET       6.400         2.98
SET       6.500         3.16
SET       6.600         3.33
SET       6.700         3.52
SET       6.800         3.71
SET       6.900         3.92
SET       7.000         4.11
SET       7.100         4.33
SET       7.200         4.57
SET       7.300         4.84
SET       7.400         5.07
SET       7.500         5.32
SET       7.600         5.60
SET       7.700         5.88
SET       7.800         6.22
SET       7.900         6.57
SET       8.000         6.88
SET       8.100         7.26
SET       8.200         7.65
SET       8.300         8.05
SET       8.400         8.45
SET       8.500         8.89
SET       8.600         9.37
SET       8.700         9.86
SET       8.800        10.40
SET       8.900        10.96
SET       9.000        11.56
SET       9.100        12.18
SET       9.200        12.82
SET       9.300        13.54
SET       9.400        14.34
SET       9.500        15.11
SET       9.600        15.97
SET       9.700        16.91
SET       9.800        17.90
SET       9.900        18.91
SET      10.000        24.47
SET      11.000        33.96
SET      12.000        43.02
SET      13.000        51.51
SET      14.000        59.19
SET      15.000        66.14
SET      16.000        72.31
SET      17.000        77.71
SET      18.000        82.18
SET      19.000        85.76
SET      20.000        88.74
SET      21.000        90.97
SET      22.000        92.70
SET      23.000        94.06
SET      24.000        95.16
SET      25.000        96.07
SET      26.000        96.78
SET      27.000        97.35
SET      28.000        97.73
SET      29.000        98.03
SET      30.000        98.28
SET      31.000        98.47
SET      32.000        98.64
SET      33.000        98.81
SET      34.000        98.95
SET      35.000        99.08
SET      36.000        99.19
SET      37.000        99.28
SET      38.000        99.37
SET      39.000        99.43
SET      40.000        99.50
SET      41.000        99.55
SET      42.000        99.60
SET      43.000        99.63
SET      44.000        99.66
SET      45.000        99.68
SET      46.000        99.71
SET      47.000        99.74
SET      48.000        99.76
SET      49.000        99.78
SET      50.000        99.80
SET      51.000        99.82
SET      52.000        99.84
SET      53.000        99.86
SET      54.000        99.87
SET      55.000        99.88
SET      56.000        99.89
SET      57.000        99.90
SET      58.000        99.90
SET      59.000        99.91
SET      60.000        99.92
SET      61.000        99.92
SET      62.000        99.93
SET      63.000        99.93
SET      64.000        99.94
SET      65.000        99.94
SET      66.000        99.94
SET      67.000        99.94
SET      68.000        99.95
SET      69.000        99.95
SET      71.000        99.95
SET      72.000        99.95
SET      73.000        99.95
SET      74.000        99.95
SET      75.000        99.95
SET      76.000        99.95
SET      77.000        99.96
SET      79.000        99.96
SET      83.000        99.96
SET      85.000        99.96
SET     130.000        99.98
SET     140.000        99.98
SET     160.000        99.98
SET     170.000        99.99
SET     180.000        99.99
SET     190.000        99.99
SET     200.000       100.00
---
---